from string import Template

### Rag Prompts ###

### System

system_prompt = Template(
    "\n".join([
        "أنت مساعد لتوليد إجابة للمستخدم.",
        "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
        "يجب عليك توليد الإجابة بناءً على المستندات المقدمة.",
        "تجاهل المستندات غير المتعلقة باستفسار المستخدم.",
        "يمكنك الاعتذار للمستخدم إذا لم تكن قادراً على توليد إجابة.",
        "يجب عليك توليد الإجابة بنفس لغة استفسار المستخدم.",
        "كن مهذباً ومحترماً مع المستخدم.",
        "كن دقيقاً وموجزاً في إجابتك. وتجنب المعلومات غير الضرورية."
    ])
)

### Document 
document_prompt = Template(
    "\n".join([
        "## مستند رقم: $doc_number",
        "### المحتوى: $chunk_text",
    ])
)

### Footer

footer_prompt = Template(
    "\n".join([
        "## بناءً على المستندات أعلاه فقط، يرجى توليد إجابة للمستخدم.",
        "## السؤال:",
        "$query",
        "### الإجابة:",
    ])
)